; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	spectrograph1 - mode
	image0 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star6 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star6)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star9)
	(have_image Star7 image0)
	(have_image Phenomenon8 image0)
	(have_image Star9 infrared2)
	(have_image Planet10 spectrograph1)
	(have_image Star11 spectrograph1)
	(have_image Phenomenon12 spectrograph1)
	(have_image Planet13 spectrograph1)
	(have_image Planet14 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation4 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 9
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
3. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 9
4. (turn_to satellite1 planet13 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet13)
   goals met: 0 of 9
5. (take_image satellite1 planet13 instrument3 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 1 of 9
6. (turn_to satellite1 planet10 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet10)
   goals met: 1 of 9
7. (take_image satellite1 planet10 instrument3 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon8 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon8)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon8 instrument3 image0)
   added: (have_image phenomenon8 image0)
   goals met: 3 of 9
10. (turn_to satellite1 phenomenon12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 9
11. (take_image satellite1 phenomenon12 instrument3 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 4 of 9
12. (turn_to satellite0 star9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star9)
   goals met: 5 of 9
13. (turn_to satellite1 planet14 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 planet14)
   goals met: 5 of 9
14. (take_image satellite1 planet14 instrument3 infrared2)
   added: (have_image planet14 infrared2)
   goals met: 6 of 9
15. (turn_to satellite1 star11 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star11)
   goals met: 6 of 9
16. (take_image satellite1 star11 instrument3 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 7 of 9
17. (turn_to satellite1 star7 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star7)
   goals met: 7 of 9
18. (take_image satellite1 star7 instrument3 image0)
   added: (have_image star7 image0)
   goals met: 8 of 9
19. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 8 of 9
20. (take_image satellite1 star9 instrument3 infrared2)
   added: (have_image star9 infrared2)
   goals met: 9 of 9
